---
kind: method
id: M:Autodesk.Revit.DB.PlanCircuitSet.ReverseIterator
source: html/6fcdecf0-916a-fc5b-170c-c7fa49ec978a.htm
---
# Autodesk.Revit.DB.PlanCircuitSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual PlanCircuitSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.